Revit 2027 API
BendingDetailAngularDimensionsDisplayOptions Enumeration
 Describes the angular dimensions display options.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BendingDetailAngularDimensionsDisplayOptions
Public Enumeration BendingDetailAngularDimensionsDisplayOptions
public enum class BendingDetailAngularDimensionsDisplayOptions
type BendingDetailAngularDimensionsDisplayOptions
Members
Member name | Value | Description
AllAngles | 0 |  Display for all angle values.
Exclude90Degrees | 1 |  Display for all angle values except the 90 degree.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace